MRazvan/cc1310_simple_radio/cc1310/inc/hw_fcfg1.h
// Field:  [11:6] LDOVCO_TRIM_OUTPUT
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_SYNTH_DIV15_LDOVCO_TRIM_OUTPUT_W                        6
#define FCFG1_CONFIG_SYNTH_DIV15_LDOVCO_TRIM_OUTPUT_M               0x00000FC0
#define FCFG1_CONFIG_SYNTH_DIV15_LDOVCO_TRIM_OUTPUT_S                        6

// Field:   [5:0] SLDO_TRIM_OUTPUT
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_SYNTH_DIV15_SLDO_TRIM_OUTPUT_W                          6
#define FCFG1_CONFIG_SYNTH_DIV15_SLDO_TRIM_OUTPUT_M                 0x0000003F
#define FCFG1_CONFIG_SYNTH_DIV15_SLDO_TRIM_OUTPUT_S                          0

//*****************************************************************************
//
// Register: FCFG1_O_CONFIG_SYNTH_DIV30
//
//*****************************************************************************
// Field:    [28] DISABLE_CORNER_CAP
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_SYNTH_DIV30_DISABLE_CORNER_CAP                 0x10000000
#define FCFG1_CONFIG_SYNTH_DIV30_DISABLE_CORNER_CAP_BITN                    28
#define FCFG1_CONFIG_SYNTH_DIV30_DISABLE_CORNER_CAP_M               0x10000000
#define FCFG1_CONFIG_SYNTH_DIV30_DISABLE_CORNER_CAP_S                       28

// Field: [27:12] RFC_MDM_DEMIQMC0
//
// Trim value for RF Core.
// Value is read by RF Core ROM FW during RF Core initialization.
#define FCFG1_CONFIG_SYNTH_DIV30_RFC_MDM_DEMIQMC0_W                         16
#define FCFG1_CONFIG_SYNTH_DIV30_RFC_MDM_DEMIQMC0_M                 0x0FFFF000
#define FCFG1_CONFIG_SYNTH_DIV30_RFC_MDM_DEMIQMC0_S                         12

// Field:  [11:6] LDOVCO_TRIM_OUTPUT
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_SYNTH_DIV30_LDOVCO_TRIM_OUTPUT_W                        6
#define FCFG1_CONFIG_SYNTH_DIV30_LDOVCO_TRIM_OUTPUT_M               0x00000FC0
#define FCFG1_CONFIG_SYNTH_DIV30_LDOVCO_TRIM_OUTPUT_S                        6

// Field:   [5:0] SLDO_TRIM_OUTPUT
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_SYNTH_DIV30_SLDO_TRIM_OUTPUT_W                          6
#define FCFG1_CONFIG_SYNTH_DIV30_SLDO_TRIM_OUTPUT_M                 0x0000003F
#define FCFG1_CONFIG_SYNTH_DIV30_SLDO_TRIM_OUTPUT_S                          0

//*****************************************************************************
//
// Register: FCFG1_O_CONFIG_MISC_ADC_DIV5
//
//*****************************************************************************
// Field: [21:18] MIN_ALLOWED_RTRIM
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_MISC_ADC_DIV5_MIN_ALLOWED_RTRIM_W                       4
#define FCFG1_CONFIG_MISC_ADC_DIV5_MIN_ALLOWED_RTRIM_M              0x003C0000
#define FCFG1_CONFIG_MISC_ADC_DIV5_MIN_ALLOWED_RTRIM_S                      18

// Field:  [16:9] RSSI_OFFSET
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_MISC_ADC_DIV5_RSSI_OFFSET_W                             8
#define FCFG1_CONFIG_MISC_ADC_DIV5_RSSI_OFFSET_M                    0x0001FE00
#define FCFG1_CONFIG_MISC_ADC_DIV5_RSSI_OFFSET_S                             9

// Field:   [8:6] QUANTCTLTHRES
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_MISC_ADC_DIV5_QUANTCTLTHRES_W                           3
#define FCFG1_CONFIG_MISC_ADC_DIV5_QUANTCTLTHRES_M                  0x000001C0
#define FCFG1_CONFIG_MISC_ADC_DIV5_QUANTCTLTHRES_S                           6

// Field:   [5:0] DACTRIM
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_MISC_ADC_DIV5_DACTRIM_W                                 6
#define FCFG1_CONFIG_MISC_ADC_DIV5_DACTRIM_M                        0x0000003F
#define FCFG1_CONFIG_MISC_ADC_DIV5_DACTRIM_S                                 0

//*****************************************************************************
//
// Register: FCFG1_O_CONFIG_MISC_ADC_DIV6
//
//*****************************************************************************
// Field: [21:18] MIN_ALLOWED_RTRIM
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_MISC_ADC_DIV6_MIN_ALLOWED_RTRIM_W                       4
#define FCFG1_CONFIG_MISC_ADC_DIV6_MIN_ALLOWED_RTRIM_M              0x003C0000
#define FCFG1_CONFIG_MISC_ADC_DIV6_MIN_ALLOWED_RTRIM_S                      18

// Field:  [16:9] RSSI_OFFSET
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_MISC_ADC_DIV6_RSSI_OFFSET_W                             8
#define FCFG1_CONFIG_MISC_ADC_DIV6_RSSI_OFFSET_M                    0x0001FE00
#define FCFG1_CONFIG_MISC_ADC_DIV6_RSSI_OFFSET_S                             9

// Field:   [8:6] QUANTCTLTHRES
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_MISC_ADC_DIV6_QUANTCTLTHRES_W                           3
#define FCFG1_CONFIG_MISC_ADC_DIV6_QUANTCTLTHRES_M                  0x000001C0
#define FCFG1_CONFIG_MISC_ADC_DIV6_QUANTCTLTHRES_S                           6

// Field:   [5:0] DACTRIM
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_MISC_ADC_DIV6_DACTRIM_W                                 6
#define FCFG1_CONFIG_MISC_ADC_DIV6_DACTRIM_M                        0x0000003F
#define FCFG1_CONFIG_MISC_ADC_DIV6_DACTRIM_S                                 0

//*****************************************************************************
//
// Register: FCFG1_O_CONFIG_MISC_ADC_DIV10
//
//*****************************************************************************
// Field: [21:18] MIN_ALLOWED_RTRIM
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_MISC_ADC_DIV10_MIN_ALLOWED_RTRIM_W                      4
#define FCFG1_CONFIG_MISC_ADC_DIV10_MIN_ALLOWED_RTRIM_M             0x003C0000
#define FCFG1_CONFIG_MISC_ADC_DIV10_MIN_ALLOWED_RTRIM_S                     18

// Field:  [16:9] RSSI_OFFSET
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_MISC_ADC_DIV10_RSSI_OFFSET_W                            8
#define FCFG1_CONFIG_MISC_ADC_DIV10_RSSI_OFFSET_M                   0x0001FE00
#define FCFG1_CONFIG_MISC_ADC_DIV10_RSSI_OFFSET_S                            9

