MRazvan/cc1310_simple_radio/cc1310/inc/hw_fcfg1.h
// Field:  [15:8] CTRIMFRACT_QUAD
//
// Internal. Only to be used through TI provided API.
#define FCFG1_RCOSC_HF_TEMPCOMP_CTRIMFRACT_QUAD_W                            8
#define FCFG1_RCOSC_HF_TEMPCOMP_CTRIMFRACT_QUAD_M                   0x0000FF00
#define FCFG1_RCOSC_HF_TEMPCOMP_CTRIMFRACT_QUAD_S                            8

// Field:   [7:0] CTRIMFRACT_SLOPE
//
// Internal. Only to be used through TI provided API.
#define FCFG1_RCOSC_HF_TEMPCOMP_CTRIMFRACT_SLOPE_W                           8
#define FCFG1_RCOSC_HF_TEMPCOMP_CTRIMFRACT_SLOPE_M                  0x000000FF
#define FCFG1_RCOSC_HF_TEMPCOMP_CTRIMFRACT_SLOPE_S                           0

//*****************************************************************************
//
// Register: FCFG1_O_TRIM_CAL_REVISION
//
//*****************************************************************************
// Field: [31:16] FT1
//
// Internal. Only to be used through TI provided API.
#define FCFG1_TRIM_CAL_REVISION_FT1_W                                       16
#define FCFG1_TRIM_CAL_REVISION_FT1_M                               0xFFFF0000
#define FCFG1_TRIM_CAL_REVISION_FT1_S                                       16

// Field:  [15:0] MP1
//
// Internal. Only to be used through TI provided API.
#define FCFG1_TRIM_CAL_REVISION_MP1_W                                       16
#define FCFG1_TRIM_CAL_REVISION_MP1_M                               0x0000FFFF
#define FCFG1_TRIM_CAL_REVISION_MP1_S                                        0

//*****************************************************************************
//
// Register: FCFG1_O_ICEPICK_DEVICE_ID
//
//*****************************************************************************
// Field: [31:28] PG_REV
//
// Field used to distinguish revisions of the device.
#define FCFG1_ICEPICK_DEVICE_ID_PG_REV_W                                     4
#define FCFG1_ICEPICK_DEVICE_ID_PG_REV_M                            0xF0000000
#define FCFG1_ICEPICK_DEVICE_ID_PG_REV_S                                    28

// Field: [27:12] WAFER_ID
//
// Field used to identify silicon die.
#define FCFG1_ICEPICK_DEVICE_ID_WAFER_ID_W                                  16
#define FCFG1_ICEPICK_DEVICE_ID_WAFER_ID_M                          0x0FFFF000
#define FCFG1_ICEPICK_DEVICE_ID_WAFER_ID_S                                  12

// Field:  [11:0] MANUFACTURER_ID
//
// Manufacturer code.
//
// 0x02F: Texas Instruments
#define FCFG1_ICEPICK_DEVICE_ID_MANUFACTURER_ID_W                           12
#define FCFG1_ICEPICK_DEVICE_ID_MANUFACTURER_ID_M                   0x00000FFF
#define FCFG1_ICEPICK_DEVICE_ID_MANUFACTURER_ID_S                            0

//*****************************************************************************
//
// Register: FCFG1_O_FCFG1_REVISION
//
//*****************************************************************************
// Field:  [31:0] REV
//
// The revision number of the FCFG1 layout. This value will be read by
// application SW in order to determine which FCFG1 parameters that have valid
// values. This revision number must be incremented by 1 before any devices are
// to be produced if the FCFG1 layout has changed since the previous production
// of devices.
// Value migth change without warning.
#define FCFG1_FCFG1_REVISION_REV_W                                          32
#define FCFG1_FCFG1_REVISION_REV_M                                  0xFFFFFFFF
#define FCFG1_FCFG1_REVISION_REV_S                                           0

//*****************************************************************************
//
// Register: FCFG1_O_MISC_OTP_DATA
//
//*****************************************************************************
// Field: [31:28] RCOSC_HF_ITUNE
//
// Internal. Only to be used through TI provided API.
#define FCFG1_MISC_OTP_DATA_RCOSC_HF_ITUNE_W                                 4
#define FCFG1_MISC_OTP_DATA_RCOSC_HF_ITUNE_M                        0xF0000000
#define FCFG1_MISC_OTP_DATA_RCOSC_HF_ITUNE_S                                28

// Field: [27:20] RCOSC_HF_CRIM
//
// Internal. Only to be used through TI provided API.
#define FCFG1_MISC_OTP_DATA_RCOSC_HF_CRIM_W                                  8
#define FCFG1_MISC_OTP_DATA_RCOSC_HF_CRIM_M                         0x0FF00000
#define FCFG1_MISC_OTP_DATA_RCOSC_HF_CRIM_S                                 20

// Field: [19:15] PER_M
//
// Internal. Only to be used through TI provided API.
#define FCFG1_MISC_OTP_DATA_PER_M_W                                          5
#define FCFG1_MISC_OTP_DATA_PER_M_M                                 0x000F8000
#define FCFG1_MISC_OTP_DATA_PER_M_S                                         15

// Field: [14:12] PER_E
//
// Internal. Only to be used through TI provided API.
#define FCFG1_MISC_OTP_DATA_PER_E_W                                          3
#define FCFG1_MISC_OTP_DATA_PER_E_M                                 0x00007000
#define FCFG1_MISC_OTP_DATA_PER_E_S                                         12

// Field:  [11:8] MIN_ALLOWED_RTRIM_DIV5
//
// Internal. Only to be used through TI provided API.
#define FCFG1_MISC_OTP_DATA_MIN_ALLOWED_RTRIM_DIV5_W                         4
#define FCFG1_MISC_OTP_DATA_MIN_ALLOWED_RTRIM_DIV5_M                0x00000F00
#define FCFG1_MISC_OTP_DATA_MIN_ALLOWED_RTRIM_DIV5_S                         8

// Field:   [7:0] TEST_PROGRAM_REV
//
// The revision of the test program used in the production process when FCFG1
// was programmed.
// Value migth change without warning.
#define FCFG1_MISC_OTP_DATA_TEST_PROGRAM_REV_W                               8
#define FCFG1_MISC_OTP_DATA_TEST_PROGRAM_REV_M                      0x000000FF
#define FCFG1_MISC_OTP_DATA_TEST_PROGRAM_REV_S                               0

//*****************************************************************************
//
// Register: FCFG1_O_IOCONF
//
//*****************************************************************************
// Field:   [6:0] GPIO_CNT
//
// Number of available DIOs.
#define FCFG1_IOCONF_GPIO_CNT_W                                              7
#define FCFG1_IOCONF_GPIO_CNT_M                                     0x0000007F
#define FCFG1_IOCONF_GPIO_CNT_S                                              0

//*****************************************************************************
//
// Register: FCFG1_O_CONFIG_IF_ADC
//
//*****************************************************************************
// Field: [31:28] FF2ADJ
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_IF_ADC_FF2ADJ_W                                         4
#define FCFG1_CONFIG_IF_ADC_FF2ADJ_M                                0xF0000000
#define FCFG1_CONFIG_IF_ADC_FF2ADJ_S                                        28

// Field: [27:24] FF3ADJ
//
// Internal. Only to be used through TI provided API.
#define FCFG1_CONFIG_IF_ADC_FF3ADJ_W                                         4
#define FCFG1_CONFIG_IF_ADC_FF3ADJ_M                                0x0F000000
#define FCFG1_CONFIG_IF_ADC_FF3ADJ_S                                        24

